{
  "chapter_1": {
    "scene_1": {
      "lines": [
        "You wake up sprawled on the ground, unsure of your surroundings and how or why you're here.",
        "You rub the dust from your eyes and blink them repeatedly in an attempt to clear your vision.",
        "As your vision clears, to your surprise, you find yourself in a dark cavern, only barely illuminated by the faint blue glow of some kind of flourescent moss on the cave wall."
      ],
      "options": [
        {
          "option_number": 1,
          "option_text": "Look around for any clues as to where you are.",
          "result_lines": [
            "You glance around the cave noticing that there is freshly disturbed dirt and sand strewn around you, and an imprint from where you had previously lain.",
            "Some of the soil looks wet, for unknown reasons.",
            "You notice that there are two sets of footprints, one booted, which matches what you're wearing.",
            "The other set of prints looks smaller than the first, almost child-sized; you can follow the prints to a few feet away where the dirt and sand patch transitions to stone."
          ],
          "next_scene": 0,
          "health_change": 0
        },
        {
          "option_number": 2,
          "option_text": "Show your frustration at the situation by kicking the small rock in front of you.",
          "result_lines": [
            "You kick the small rock, but unfortunately it is connected to the much larger stone floor beneath the sand and gravel.",
            "You stub your toe."
          ],
          "next_scene": 0,
          "health_change": -1
        },
        {
          "option_number": 3,
          "option_text": "Follow the general direction of the cave.",
          "result_lines": [
            "With nothing else to see or do in this part of the cave, it seems prudent to move on."
          ],
          "next_scene": 1,
          "health_change": 0
        }
      ]
    },
    "scene_2": {
      "lines": [
        "The crunch of sand and dirt under your feet subsides as the soil gives way to stone.",
        "You walk carefully, cognizant of the difficulty of walking in the dim, blue-tinted light.",
        "The cave begins to narrow, and the height of the cave decreases, necessitating that you slow your pace considerably.",
        "At this point, you have to stoop low, even crawling at times.",
        "You come to a fork.",
        "To the left, the tunnel appears to grow in size, but gets progressively darker, even less than what little light you currently have. You would be able to stand more upright were you to take this tunnel. ",
        "To the right, the tunnel gets smaller, but appears slightly brighter due to a yellow moss that mixes in with the fluorescent blue. It looks like you would have to crawl on your hands and knees for this tunnel."
      ],
      "options": [
        {
          "option_number": 1,
          "option_text": "Do nothing",
          "result_lines": [
            "You sit for an hour, which turns into two, then four.",
            "You get progressively hungrier."
          ],
          "next_scene": 0,
          "health_change": -1,
          "instadeath": 0
        },
        {
          "option_number": 2,
          "option_text": "Head to the left tunnel",
          "result_lines": [
            "As you enter the mouth of the darker tunnel, you slow your pace, unsure of your footing in the dark.",
            "You feel your shoes begin to move small objects on the ground, making a slight crunching sound, as the objects slide past one another.",
            "Each time you put your weight down, the crunching sound gets louder, crushing whatever it is that’s underfoot.",
            "You do your best to ignore the sound, and what it might be that you’re walking through in the dark."
          ],
          "next_scene": 1,
          "health_change": 0,
          "instadeath": 0
        },
        {
          "option_number": 3,
          "option_text": "Head to the right tunnel",
          "result_lines": [
            "You follow the smaller cave, toward the welcoming blue and yellow light.",
            "The mix of the two mosses casts a green pallor over the increasingly narrow cave.",
            "You continue to crawl forward, and over the next few yards, the ceiling gradually lowers.",
            "Yard by yard, you make forward progress, but the ceiling drops still further.",
            "Eventually, the ceiling becomes low enough that you have to slither along your belly.",
            "The tunnel, still glowing green, slopes downward.",
            "You continue forward, resolute that this was the correct path, as the ceiling scrapes across your back.",
            "Eventually, the stone floor and ceiling presses against you, preventing a full breath.",
            "The downward slope prevents backward movement; maybe this wasn't the best choice.",
            "At this point, you cannot move forward, nor backward.",
            "Your only option is to contemplate what a poor choice this was as you gradually die from exposure."
          ],
          "next_scene": 0,
          "health_change": -20,
          "instadeath": 0
        }
      ]
    },
    "scene_3": {
      "lines": [
        "After about 100 yards of excruciatingly slow shuffling, the tunnel begins to brighten. ",
        "It’s finally bright enough for you to see your hands in front of your face.",
        "After another hundred yards of slightly faster walking, your elation at having some light quickly changes to fear as you begin to hear what sounds like whispers and the scuffling of feet to your starved senses.",
        "Occasionally you hear a ‘thunk’ that echoes enough times to raise the hair on your neck."
      ],
      "options": [
        {
          "option_number": 1,
          "option_text": "Keep walking",
          "result_lines": [
            "A healthy dose of fear prompts you to continue onward- you would rather not know what those sound are, or where they are coming from. ",
            "You continue ahead, and the scuffling sounds lessen, much to your relief."
          ],
          "next_scene": 1,
          "health_change": 0,
          "instadeath": 0
        },
        {
          "option_number": 2,
          "option_text": "Yell to try to scare away whatever is causing the sound",
          "result_lines": [
            "You yell out at the top of your lungs, and the sound is deafening in this small chamber.",
            "Your ears ring for a bit. ",
            "After the ringing subsides, you no longer hear anything but the sound of your breath and your thudding heart and the occasional ‘thunk’ that you still haven’t identified. "
          ],
          "next_scene": 0,
          "health_change": 0,
          "instadeath": 0
        },
        {
          "option_number": 3,
          "option_text": "Stop to investigate the sounds you hear",
          "result_lines": [
            "You slowly turn in place, scanning with your eyes and trying to pinpoint the source of the sound.",
            "At first, it seems as though the sound is coming from all directions. ",
            "Eventually you realize that along the floor are a couple of small holes, about the size of up it fist. ",
            "You’re positive that the sounds originate here; you slowly creep toward it to get a better look. ",
            "You squat down to look at the hole, becoming increasingly dire that this is the source of the sounds. ",
            "The holes are dark, so you peer close. ",
            "You see a flash of red and yellow flecked eyes before feeling a burning sting on your face. ",
            "Quickly, you wipe your skin with your sleeve and the pain subsides, but your sleeve starts to smolder.",
            "You tear the sleeve off, grateful that you didn’t experience anything more than the brief bit of pain from whatever the creature spit at you. "
          ],
          "next_scene": 0,
          "health_change": -3,
          "instadeath": 0
        }
      ]
    },
    "scene_4": {
      "lines": [
        "You reach the mouth of a cavern, lit slightly by more blue flourescent moss.",
        "On one side of the cavern is a small creek, about three feet wide and flowing slowly, it’s origin somewhere off to the side in the distance.",
        "The creek is beset on either side by small rocks and sand, not unlike that of the first cavern you found yourself in.",
        "The water flows off to your left to about a stone’s throw away, at which point it immediately drops away.",
        "To the right, up the creek a short distance, is a small wooden water wheel, spinning slowly with the water’s flow, which spins a series of gears, ultimately causing a wooden beam the size of your arm to raise and periodically drop onto a small raised wooden pedestal.",
        "Next to wheel is a wooden platform."
      ],
      "options": [
        {
          "option_number": 1,
          "option_text": "Investigate the water of the creek",
          "result_lines": [
            "You carefully walk up to the creek, then squat down to look closely at the water.",
            "Your reflection stares back at you; if it were brighter you would see your swollen eyes and dusty face.",
            "Briefly, you see the flash of something under the water.",
            "Before you know it, the flash of silver is gone, and all you see is the undulating surface of the water."
          ],
          "next_scene": 0,
          "health_change": 0,
          "instadeath": 0
        },
        {
          "option_number": 2,
          "option_text": "Walk to the left to see where the water goes.",
          "result_lines": [
            "You take a handful of steps toward the left to see where the water goes.",
            "As you get closer, you notice a very cold draft coming from ahead of you, and a hollow echo from the water as it drops over the side of what is apparently a cliff.",
            "You listen closely, trying to determine how far the water might drop, but its too far to make an accurate guess.",
            "Curious, you creep closer to where you think the edge is.",
            "Suddenly, your heel slips out from underneath you; you twist in an attempt not to fall over the edge.",
            "You scramble, raking your hands against the stone floor, catching yourself with only your shins dangling over.",
            "You're still alive, but did a number on your hands trying to catch yourself."
          ],
          "next_scene": 0,
          "health_change": -4,
          "instadeath": 0
        },
        {
          "option_number": 3,
          "option_text": "Check out the water wheel and platform.",
          "result_lines": [
              "A large wooden chest sits next to the wooden platform, unlocked.",
              "You hadn’t noticed before, but a small tin sits atop a metal grate, deep in a hole near the chest, above a fire gives off no smoke.",
              "'Finally!' you think. 'Maybe there is someone here that might know what the heck is going on!'"
          ],
          "next_scene": 1,
          "health_change": 0,
          "instadeath": 0
        }
      ]
    }
  }
}
